'''
Задача 2: Найдите сумму цифр трехзначного числа. 123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0)
'''
# number = input('Введите 3-х значное число: ')
# res = 0
# if len(number) == 3:
#     for i in number:
#         res += int(i)
#     print(res)
# else:
#     print('Вы ввели не 3-х значное число')

'''
Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе
они сделали S журавликов. Сколько журавликов сделал каждый
ребенок, если известно, что Петя и Сережа сделали одинаковое
количество журавликов, а Катя сделала в два раза больше журавликов,
чем Петя и Сережа вместе?
6 -> 1 4 1
24 -> 4 16 4
60 -> 10 40 10
'''
# s = int(input('Введите обшее количество журавликов: '))

# print( 'Петя и Сережа сделали по',s/6, 'журавликов, a Катя сделала ', s/6*4, 'журавликов')

'''
Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы
расплачивались за проезд и получали билет с номером. Счастливым
билетом называют такой билет с шестизначным номером, где сумма
первых трех цифр равна сумме последних трех. Т.е. билет с номером
385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать
программу, которая проверяет счастливость билета.
385916 -> yes
123456 -> no
# '''
# s = input('Введите шестизначный номер билета: ')

# a = int(s[0]) + int(s[1]) + int(s[2])
# b = int(s[3]) + int(s[4]) + int(s[5])
# if a == b:
#     print('Yes')
# else:
#     print('No')

'''
Задача 8: Требуется определить, можно ли от шоколадки размером n
× m долек отломить k долек, если разрешается сделать один разлом по
прямой между дольками (то есть разломить шоколадку на два
прямоугольника).
3 2 4 -> yes
3 2 1 -> no
'''
# n = int(input('Введите ширину шоколадки: '))
# m = int(input('Введите длину шоколадки: '))
# k = int(input('Введите колличество долек шоколадки: '))
# if k%n == 0 or k%m == 0:
#     print('Yes')
# else:
#     print('No')