'''
Задача 2: Найдите сумму цифр трехзначного числа. 123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0)
'''
# number = input('Введите 3-х значное число: ')
# res = 0
# if len(number) == 3:
#     for i in number:
#         res += int(i)
#     print(res)
# else:
#     print('Вы ввели не 3-х значное число')

'''
Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе
они сделали S журавликов. Сколько журавликов сделал каждый
ребенок, если известно, что Петя и Сережа сделали одинаковое
количество журавликов, а Катя сделала в два раза больше журавликов,
чем Петя и Сережа вместе?
6 -> 1 4 1
24 -> 4 16 4
60 -> 10 40 10
'''
# s = int(input('Введите обшее количество журавликов: '))

# print( 'Петя и Сережа сделали по',s/6, 'журавликов, a Катя сделала ', s/6*4, 'журавликов')

